package ru.praktikum.tests;

import org.junit.Rule;
import org.junit.Test;
import org.junit.runner.RunWith;
import org.junit.runners.Parameterized;
import org.openqa.selenium.WebDriver;
import ru.praktikum.pages.MainPage;
import ru.praktikum.pages.OrderPage;
import ru.praktikum.steps.OrderSteps;

@RunWith(Parameterized.class)
public class ScooterOrderFormValidationTest {
    private final String firstName;
    private final String lastName;
    private final String address;
    private final String metroStation;
    private final String phoneNumber;
    private final String deliveryDate;
    private final String rentalPeriod;
    private final String scooterColour;
    private final String comment;
    private final String expectedError;
    private final boolean shouldShowError;
    @Rule
    public DriverFactory driverFactory = new DriverFactory();

    public ScooterOrderFormValidationTest(String firstName, String lastName, String address, String metroStation, String phoneNumber, String deliveryDate, String rentalPeriod, String scooterColour, String comment, String expectedError, boolean shouldShowError) {
        this.firstName = firstName;
        this.lastName = lastName;
        this.address = address;
        this.metroStation = metroStation;
        this.phoneNumber = phoneNumber;
        this.deliveryDate = deliveryDate;
        this.rentalPeriod = rentalPeriod;
        this.scooterColour = scooterColour;
        this.comment = comment;
        this.expectedError = expectedError;
        this.shouldShowError = shouldShowError;
    }

    // Тестовые данные
    @Parameterized.Parameters(name = "Тестовые данные: {0}, {1}, {2}, {3}, {4}, {5}, {6}, {7}, {8}, {9}, {10}")
    public static Object[][] getCredentials() {
        return new Object[][]{
                // Тесты на поле "Имя"
                // Не заполнено (невалидно)
                {"", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректное имя", true},
                // 1 сивол (невалидно)
                {"А", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректное имя", true},
                // 16 символов (невалидно)
                {"Абдурахмангаджин", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректное имя", true},
                // латиница (невалидно)
                {"Anya", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректное имя", true},
                // цифры (невалидно)
                {"Аня1", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректное имя", true},
                // спецсимволы (невалидно)
                {"Аня&Аня", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректное имя", true},
                // 2 символа (валидно)
                {"Ая", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректное имя", false},
                // 3 символа (валидно)
                {"Аня", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректное имя", false},
                // 14 символов (валидно)
                {"Абдурахмангадж", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректное имя", false},
                // 15 символов (валидно)
                {"Абдурахмангаджи", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректное имя", false},

                // Тесты на поле "Фамилия"
                // Не заполнено (невалидно)
                {"Аня", "", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректную фамилию", true},
                // 1 символ (невалидно)
                {"Анна", "А", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректную фамилию", true},
                // латиница (невалидно)
                {"Анна", "Simpson", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректную фамилию", true},
                // цифры (невалидно)
                {"Анна", "Аня5", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректную фамилию", true},
                // спецсимволы (невалидно)
                {"Анна", "Аня@", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректную фамилию", true},
                // 2 символа (валидно)
                {"Анна", "Ан", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректную фамилию", false},
                // 3 символа (валидно)
                {"Анна", "Аня", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректную фамилию", false},
                // 50 символов(валидно)
                {"Анна", "ПлюшшккинаПлюшшккинаПлюшшккинаПлюшшккинаПлюшшккина", "ул. Петрова, 45", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректную фамилию", false},

                // Тесты на поле "Адрес"
                // Не заполнено (невалидно)
                {"Аня", "Аннина", "", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректный адрес", true},
                // 4 символа (невалидно)
                {"Анна", "Ан", "Поле", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректный адрес", true},
                // 50 символов(невалидно)
                {"Анна", "Ан", "ПолянаПолянаПолянаПолянаПолянаПолянаПолянаПолянаПолянаорпав", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректный адрес", true},
                // латиница(невалидно)
                {"Анна", "Ан", "Polyana", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректный адрес", true},
                // спецсимволы(невалидно)
                {"Анна", "Ан", "Поляна&$", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректный адрес", true},
                // 5 символов (валидно)
                {"Анна", "Ан", "Полен", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректный адрес", false},
                // 6 символов (валидно)
                {"Анна", "Ан", "Поляна", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректный адрес", false},
                // 48  символов(валидно)
                {"Анна", "Ан", "ПолянаПолянаПолянаПолянаПолянаПолянаПолянаПоляна", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректный адрес", false},
                // 49  символов(валидно)
                {"Анна", "Ан", "ПолянаПолянаПолянаПолянаПолянаПолянаПолянаПолянаП", "Кропоткинская", "+78887776655", "22.06.2025", "сутки", "black", "", "Введите корректный адрес", false},

                // Тесты на поле "Телефон"
                // не заполнено(невалидно)
                {"Аня", "Аннина", "ул. Петрова, 45", "Кропоткинская", "", "22.06.2025", "сутки", "black", "", "Введите корректный номер", true},
                // 10 символов (невалидно)
                {"Аня", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+788877766", "22.06.2025", "сутки", "black", "", "Введите корректный номер", true},
                // 14 символов (невалидно)
                {"Аня", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+7888777666789", "22.06.2025", "сутки", "black", "", "Введите корректный номер", true},
                // буквы (невалидно)
                {"Аня", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+7965111111а", "22.06.2025", "сутки", "black", "", "Введите корректный номер", true},
                // спецсимволы (невалидно)
                {"Аня", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+7965111111@", "22.06.2025", "сутки", "black", "", "Введите корректный номер", true},
                // 11 символов (валидно)
                {"Аня", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+7888777666", "22.06.2025", "сутки", "black", "", "Введите корректный номер", false},
                // 12 символов (валидно)
                {"Аня", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+78887776667", "22.06.2025", "сутки", "black", "", "Введите корректный номер", false},
                // 13 символов (валидно)
                {"Аня", "Аннина", "ул. Петрова, 45", "Кропоткинская", "+788877766678", "22.06.2025", "сутки", "black", "", "Введите корректный номер", false},

                // Тесты на поле "Станция метро" (не заполнена - невалидно)
                {"Аня", "Аннина", "ул. Петрова, 45", "", "+7888777666", "22.06.2025", "сутки", "black", "", "Выберите станцию", true},
        };
    }

    @Test
    public void scooterOrderFormValidationTest() {
        WebDriver driver = driverFactory.getDriver();
        MainPage mainPage = new MainPage(driver);
        mainPage.openMainPage();
        mainPage.closeCookiePopup();
        OrderPage orderPage = mainPage.clickUpperOrderButton();
        OrderSteps orderSteps = new OrderSteps(orderPage, driver);
        orderSteps.fillFirstForm(firstName, lastName, address, metroStation, phoneNumber);
        orderPage.clickOrderHeader();
        orderSteps.assertValidation(expectedError, deliveryDate, rentalPeriod, scooterColour, comment, shouldShowError);
    }
}
